<a href="https://colab.research.google.com/github/HanGyeolN/CampusProject/blob/master/mission_190715.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
train_test_data = [train,test]
train_test_data

# for data in train_test_data:
#   print(data['Name'])

# 1. re

# 2. 수치로
# Mr:0, Miss:1, Mrs:2, Else:3

# 3. 새 칼럼으로 저장

In [0]:
train['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [0]:
import re

In [0]:
# 1

temp_df_list = []

for data in train_test_data:
  temp_list = []
  
  for i, name in enumerate(data['Name']):
    
    temp_dict = {}
    
    res = re.search('[,][ ][a-zA-Z\s]{1,}.', name)

    # [영어+,]로 시작
    start_pos = res.span()[0]
    end_pos = res.span()[1]

    # 추출
    mr = name[start_pos+2:end_pos-1]
    temp_dict['sir_name'] = mr
    
    temp_list.append(temp_dict)
  
  new_df = pd.DataFrame(temp_list)
  
  # 합치기
  temp_df_list.append(data.join(new_df, on=None))
  
train = temp_df_list[0]
test = temp_df_list[1]

In [0]:
# train 갯수
train.groupby('sir_name')['sir_name'].count().sort_values(ascending=False)

sir_name
Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Col               2
Mlle              2
Major             2
Jonkheer          1
Don               1
the Countess      1
Lady              1
Sir               1
Mme               1
Ms                1
Capt              1
Name: sir_name, dtype: int64

In [0]:
# test에서 갯수
test.groupby('sir_name')['sir_name'].count().sort_values(ascending=False)

sir_name
Mr        240
Miss       78
Mrs        72
Master     21
Rev         2
Col         2
Ms          1
Dr          1
Dona        1
Name: sir_name, dtype: int64

In [0]:

# 2

temp_list = []

for sir_name in train['sir_name']:
  temp_dict = {}
  
  if sir_name == 'Mr':
    temp_dict['sir_category'] = 0
  elif sir_name == 'Miss':
    temp_dict['sir_category'] = 1
  elif sir_name == 'Mrs':
    temp_dict['sir_category'] = 2
  else:
    temp_dict['sir_category'] = 3
    
  temp_list.append(temp_dict)
  
new_df = pd.DataFrame(temp_list)

train = train.join(new_df)

In [0]:
train.head()

   PassengerId Survived Pclass  ... Age_mode sir_name  sir_category
0            1        0      3  ...     22.0       Mr             0
1            2        1      1  ...     38.0      Mrs             2
2            3        1      3  ...     26.0     Miss             1
3            4        1      1  ...     35.0      Mrs             2
4            5        0      3  ...     35.0       Mr             0

[5 rows x 17 columns]

In [0]:
temp_list = []

for sir_name in test['sir_name']:
  temp_dict = {}
  
  if sir_name == 'Mr':
    temp_dict['sir_category'] = 0
  elif sir_name == 'Miss':
    temp_dict['sir_category'] = 1
  elif sir_name == 'Mrs':
    temp_dict['sir_category'] = 2
  else:
    temp_dict['sir_category'] = 3
    
  temp_list.append(temp_dict)
  
new_df = pd.DataFrame(temp_list)

test = test.join(new_df)

In [0]:
test.head()

   PassengerId  Pclass  ... sir_name sir_category
0          892       3  ...       Mr            0
1          893       3  ...      Mrs            2
2          894       2  ...       Mr            0
3          895       3  ...       Mr            0
4          896       3  ...      Mrs            2

[5 rows x 14 columns]